Revit 2027 API
BuiltInFailures.StairRampFailures.SpiralRunRadiusTooSmallFailure Property
 The radius value for the run is too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SpiralRunRadiusTooSmallFailure { get; }
Public Shared ReadOnly Property SpiralRunRadiusTooSmallFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SpiralRunRadiusTooSmallFailure {
	FailureDefinitionId^ get ();
}
static member SpiralRunRadiusTooSmallFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace